app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "lad6JLpjhSi3iC1Jizkb2Q"], ["updated_at", "2019-05-24 18:54:37.551176"], ["id", 2]]
---
    def create
        @user = User.create(user_params);
        if @user.save