app/models/user.rb

    def reset_session_token
        self.session_token = self.class.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "lad6JLpjhSi3iC1Jizkb2Q"], ["updated_at", "2019-05-24 18:54:37.551176"], ["id", 2]]